{
  "services": [
    {
      "id": "soft-services",
      "name": "Soft Services",
      "images": [
        "softImage",
        "https://imgur.com/nSC0sJc.jpg"
      ],
      "subservices": [
        {
          "name": "House Keeping",
          "image": "https://www.theurbancrews.com/wp-content/uploads/2020/08/service.jpg",
          "description": "We provide a full range of professional home cleaning services to meet your specific needs. Our skilled team offers top-quality deep cleaning and regular house cleaning just for you. We offer cleaning services for both residential and commercial spaces."
        },
        {
          "name": "Pantry Support Services",
          "image": "https://encexplorer.com/wp-content/uploads/2022/12/Restaurant-New-Bern_Date-Night-1024x536.jpg",
          "description": "Upgrade your pantry with our personalized solutions. We provide dedicated pantry staff to manage and maintain your pantry for busy offices, student campuses, and co-working spaces. Our team ensures your pantry is always well-stocked and organized to keep your space running smoothly and your team happy."
        },
        {
          "name": "Office Boy",
          "image": "https://5.imimg.com/data5/MA/AP/MY-31244159/office-boy-service-500x500.jpg",
          "description": "Improve your office with our excellent office boy services. We handle everything you need to keep your office running smoothly. Our office boys will assist in basic administrative tasks such as photocopying, filing, and delivering documents within the office, as well as organized supply management. We’re here to help your business operate efficiently."
        },
        {
          "name": "Driver",
          "image": "https://blog.oneclickdrive.com/wp-content/uploads/2018/07/driver-service-2.jpg",
          "description": "Experience better travel with our top-quality driver services. Our carefully selected drivers provide excellent service for both business and personal trips. They ensure a smooth and comfortable journey from your home to your destination. Enjoy stress-free travel with our professional drivers."
        }
      ]
    },
    {
      "id": "business-support-manpower",
      "name": "Business Support Manpower",
      "images": [
        "businessHome",
        "https://th.bing.com/th/id/R.a52a3d6f09c95aa44900bc5c42e64360?rik=paF3emeCHR9ZpQ&riu=http%3a%2f%2fwww.comproits.com%2fimages%2fman-power-support.jpg&ehk=TIRSJgJi0EyEPvojAOcDs9bKA2eGGfeGhby9UJBxDJw%3d&risl=&pid=ImgRaw&r=0.jpg"
      ],
      "subservices": [
        {
          "name": "Manufacturing Support",
          "image": "https://www.twi-global.com/image-library/hero/digital-manufacturing-istock-1022887882.jpg",
          "description": "Our manufacturing services confidently cover a wide range of sectors, delivering end-to-end solutions that enhance production processes and elevate product quality. Using the latest technology and best practices, we ensure seamless operations, cost-efficiency, and prompt delivery. Our manpower supply reliably provides the necessary skills to meet your production demands, thus enhancing operational efficiency."
        },
        {
          "name": "Sales",
          "image": "https://blog.hubspot.com/hubfs/Align-Sales-Customer-Service.jpg",
          "description": "Our Sales services are designed to help your company grow with effective sales strategies. We have a team of skilled sales professionals who excel in managing client relationships, generating leads, and closing deals. We make sure our sales experts are well-suited to your industry and market, aligning our efforts with your company's goals."
        },
        {
          "name": "IT Services",
          "image": "https://th.bing.com/th/id/R.904372fe60bc99ad186c2271e64efc22?rik=lAMltlpBpOrfxQ&riu=http%3a%2f%2fskytechgeek.com%2fwp-content%2fuploads%2f2018%2f07%2frunning-your-business-smoothly.jpg&ehk=COX%2fCxmsSrwYsYjWMqF5ZjdfECZNO3c3q6OJSwrlu%2fU%3d&risl=&pid=ImgRaw&r=0.jpg",
          "description": "Our IT services offer full support to keep your technology running smoothly. We handle everything from network management and cybersecurity to software development and technical support. Our skilled IT team keeps your systems strong and dependable, so you can focus on your main business goals with confidence in our IT services."
        }
      ]
    },
    {
      "id": "cleaning-rental-equipment",
      "name": "Cleaning Rental Equipment",
      "images": [
        "cleaningHome",
        "https://imgur.com/example4.jpg"
      ],
      "subservices": [
        {
          "name": "",
          "image": "https://th.bing.com/th/id/OIP.a_5KUrPxE3gWE3u_RDJVXwAAAA?rs=1&pid=ImgDetMain.jpg",
          "description": " Our Cleaning Rental Equipment services offer high-quality equipment for rent. Whether you need floor scrubbers, carpet cleaners, or pressure washers & many more, our wide range of tools provides the right equipment for any cleaning task. We maintain our equipment in optimal condition for high efficiency and superior performance."
        },
        {
          "name": "Advantages",
          "image": "https://assets-news.housing.com/news/wp-content/uploads/2019/09/23065452/Furniture-rentals-A-growing-trend-that-is-not-just-for-the-budget-constrained-FB-1200x628-compressed.jpg",
          "description": "<b> Easy Replacement </b> -  We offer easy replacement options for all our rental equipment, assuring minimal downtime and uninterrupted cleaning operations. If any equipment encounters issues, our quick replacement service ensures you can continue your work without delays. <br/><br/> <b> Low Investment </b> - Our rental services require a low initial investment, making it a cost-effective solution for accessing professional-grade cleaning equipment. You can achieve exceptional cleaning results without the financial burden of purchasing and maintaining costly equipment. </br><br/> <b> Advanced Equipment </b> - Our equipment comes with the latest technology to enhance productivity and efficiency. These tools feature automation and precision, reducing human error and increasing accuracy. They streamline complex tasks, save time, and cut operational costs. Additionally, our equipment is designed to be user-friendly, making it easier to handle and operate. <br/><br/> <b> No storage or maintenance concerns </b> - Our service handles all maintenance, streamlining your operations and freeing up valuable resources. By saving you both time and space, we enable your team to concentrate on core business objectives."
        }
      ]
    },
    {
      "id": "wedding-event-services",
      "name": "Wedding/Event Services",
      "images": [
        "weddingHome",
        "https://imgur.com/example8.jpg"
      ],
      "subservices": [
        {
          "name": "Helper Staff",
          "image": "https://th.bing.com/th/id/OIP.Q2oe4aWjWnSVl8DigA0jDgAAAA?rs=1&pid=ImgDetMain.jpg",
          "description": "We offer excellent wedding and event services with a skilled and friendly event staff that keeps everything running smoothly and assists guests while maintaining a professional dress code. Rely on us to manage every detail of your wedding with our extensive event services."
        },
        {
          "name": "Cleaning Equipment Services",
          "image": "https://jimmy.mu/wp-content/uploads/2022/09/hw10pro-570x570.jpg",
          "description": "<b> Tissue stand </b> - Our modern and useful tissue stands are ideal for weddings and gatherings, offering guests an effective and attractive alternative. <br/><br/> <b> Automatic wash basins </b> - These equipment not only promote hygiene but conserve water and ensure a cleaner environment. These touchless machines allow guests to wash their hands without contact, enhancing hygiene as a main priority. <br/><br/> <b> Vacuum cleaning </b> - Our high-performance vacuum cleaning equipment keeps your event venue flawless. Our powerful vacuum cleaners offer complete and efficient cleaning for carpets, floors, and furniture."
        }
      ]
    },
    {
      "id": "pest-control-services",
      "name": "Pest Control Services",
      "images": [
        "pestHome",
        "https://imgur.com/pestcontrol2.jpg"
      ],
      "subservices": [
        {
          "name": "",
          "image": "https://th.bing.com/th/id/OIP.pgmzax6uS1aBOOOdr93pXwHaEK?rs=1&pid=ImgDetMain.jpg",
          "description": "We utilize the safest and most effective pest control solutions and technologies available to protect your property from a wide variety of pests. All services are tailored to your facility's specific demands and difficulties, as well as the climate in your city. "
        }
      ]
    }
  ]
}
