{
  "services": [
    {
      "id": "soft-services",
      "name": "Soft Services",
      "images": [
        "https://imgur.com/xaUO9R9.jpg",
        "https://imgur.com/nSC0sJc.jpg"
      ],
      "subservices": [
        {
          "name": "House Keeping",
          "image": "https://imgur.com/LNlYm3Y.jpg",
          "description": "We provide a full range of professional home cleaning services to meet your specific needs. Our skilled team offers top-quality deep cleaning and regular house cleaning just for you. We offers cleaning services for both residential and commercial spaces.
"
        },
        {
          "name": "Pantry Support Services",
          "image": "https://imgur.com/4Q5HcK0.jpg",
          "description": "Upgrade your pantry with our personalized solutions. We provide dedicated pantry staff to manage and maintain your pantry for busy offices, student campuses, and co-working spaces. Our team ensures your pantry is always well-stocked and organized to keep your space running smoothly and your team happy.
        },
        {
          "name": "Office Boy",
          "image": "https://imgur.com/tc09odr.jpg",
          "description": "Improve your office with our excellent office boy services. We handle everything you need to keep your office running smoothly. Our office boys will assist in basic administrative tasks such as photocopying, filing, and delivering documents within the office, as well as organized supply management. We’re here to help your business operate efficiently."
        },
        {
          "name": "Driver",
          "image": "https://imgur.com/LzRZHzD.jpg",
          "description": "Experience better travel with our top-quality driver services. Our carefully selected drivers provide excellent service for both business and personal trips. They ensure a smooth and comfortable journey from your home to your destination. Enjoy stress-free travel with our professional drivers.
"
        }
      ]
    },
    {
      "id": "business-support-manpower",
      "name": "Business Support Manpower",
      "images": [
        "https://imgur.com/example9.jpg",
        "https://imgur.com/example10.jpg"
      ],
      "subservices": [
        {
          "name": "Manufacturing",
          "image": "https://imgur.com/example1.jpg",
          "description": "Our manufacturing services confidently cover a wide range of sectors, delivering end-to-end solutions that enhance production processes and elevate product quality. Using the latest technology and best practices, we ensure seamless operations, cost-efficiency, and prompt delivery. Our manpower supply reliably provides the necessary skills to meet your production demands, thus enhancing operational efficiency."
        },
        {
          "name": "Sales",
          "image": "https://imgur.com/example2.jpg",
          "description": "Our Sales services are designed to help your company grow with effective sales strategies. We have a team of skilled sales professionals who excel in managing client relationships, generating leads, and closing deals. We make sure our sales experts are well-suited to your industry and market, aligning our efforts with your company's goals.
"
        },
        {
          "name": "IT",
          "image": "https://imgur.com/example3.jpg",
          "description": "Our IT services offer full support to keep your technology running smoothly. We handle everything from network management and cybersecurity to software development and technical support. Our skilled IT team keeps your systems strong and dependable, so you can focus on your main business goals with confidence in our IT services.
"
        },
        {
          "name": "Other Manpower Support",
          "image": "https://imgur.com/example4.jpg",
          "description": "General manpower support for various business needs."
        }
      ]
    },
    {
      "id": "technical-services",
      "name": "Technical Services",
      "images": [
        "https://imgur.com/Lih8FiT.jpg",
        "https://imgur.com/VhMd2G9.jpg"
      ],
      "subservices": [
        {
          "name": "Façade Cleaning through Manpower",
          "image": "https://imgur.com/tc09odr.jpg",
          "description": "Manual cleaning of building exteriors by trained professionals."
        },
        {
          "name": "Façade Cleaning through Drones",
          "image": "https://imgur.com/LzRZHzD.jpg",
          "description": "Innovative drone technology for efficient and safe exterior cleaning."
        },
        {
          "name": "Marble and Granite Polishing",
          "image": "https://imgur.com/tc09odr.jpg",
          "description": "Expert polishing services for marble and granite surfaces."
        },
        {
          "name": "Carpet and Upholstery Cleaning",
          "image": "https://imgur.com/LzRZHzD.jpg",
          "description": "Deep cleaning of carpets and upholstered furniture."
        },
        {
          "name": "Waste Management",
          "image": "https://imgur.com/tc09odr.jpg",
          "description": "Comprehensive waste collection, segregation, and disposal services."
        }
      ]
    },
    {
      "id": "cleaning-rental-equipment",
      "name": "Cleaning Rental Equipment",
      "images": [
        "https://imgur.com/example3.jpg",
        "https://imgur.com/example4.jpg"
      ],
      "subservices": [
        {
          "name": "Equipment Rental",
          "image": "https://imgur.com/example5.jpg",
          "description": "Rental services for various equipment and tools."
        },
        {
          "name": "Furniture Rental",
          "image": "https://imgur.com/example6.jpg",
          "description": "Rental of furniture for events and temporary needs."
        }
      ]
    },
    {
      "id": "wedding-event-services",
      "name": "Wedding/Event Services",
      "images": [
        "https://imgur.com/example7.jpg",
        "https://imgur.com/example8.jpg"
      ],
      "subservices": [
        {
          "name": "Helper Staff",
          "image": "https://imgur.com/example1.jpg",
          "description": "Assistance from trained staff for wedding and event tasks."
        },
        {
          "name": "Cleaning Equipment Services",
          "image": "https://imgur.com/example2.jpg",
          "description": "Provision of cleaning equipment for event spaces."
        }
      ]
    },
    {
      "id": "pest-control-services",
      "name": "Pest Control Services",
      "images": [
        "https://imgur.com/pestcontrol1.jpg",
        "https://imgur.com/pestcontrol2.jpg"
      ],
      "subservices": [
        {
          "name": "Residential Pest Control",
          "image": "https://imgur.com/pestcontrol3.jpg",
          "description": "We use the safest and most efficacious pest control products and tools available, to safeguard your premises from a complete range of pests. All services are customised to the unique needs and challenges of your facility and attuned to the climatic factors of your city."
        },
        {
          "name": "Commercial Pest Control",
          "image": "https://imgur.com/pestcontrol4.jpg",
          "description": "Pest management services for businesses and commercial properties."
        }
      ]
    }
  ]
}
